# Probability

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv('train.csv')

In [3]:
df=data.copy()

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### What is the probability that the person will survive

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
survived=len(df[df['Survived']==1])
total=len(df['Survived'])

In [9]:
p_survived=survived/total*100
print("%.2f" % p_survived)

38.38

In [10]:
pd.crosstab(index=df['Pclass'],columns=df['Survived'],margins=True)

Survived    0    1  All
Pclass
1          80  136  216
2          97   87  184
3         372  119  491
All       549  342  891

### Contingency Table

In [13]:
data=pd.read_csv('ct_dataset.csv')
df=data.copy()

In [14]:
contingency_table= pd.crosstab(index=df['Subjective Social Class Identity'], 
                            columns=df['Objective Social Class Positions'],
                             margins=True)

In [15]:
contingency_table

Objective Social Class Positions  Upper Middle Class  Working Class  All
Subjective Social Class Identity
Middle Class                                      13             32   45
Upper Middle Class                                37              8   45
Working Class                                      0              8    8
All                                               50             48   98

In [16]:
contingency_table.columns

Index(['Upper Middle Class', 'Working Class', 'All'], dtype='object', name='Objective Social Class Positions')

### Marginal Probability

What is the probability that a student’s objective social position is upper middle class?

In [17]:
idx = pd.IndexSlice
umc=contingency_table.loc[idx['All'], idx['Upper Middle Class']]
total=contingency_table.loc[idx['All'], idx['All']]

In [18]:
p_upper=umc/total
print('% .2f'%p_upper)

 0.51

### Joint Probability

What is the probability that a student’s objective position and subjective identity are both upper middle class?

P (obj UMC & sub UMC) = ?

In [19]:
umc=contingency_table.loc[idx['Upper Middle Class'], idx['Upper Middle Class']]
total=contingency_table.loc[idx['All'], idx['All']]
p_upper=umc/total
print('% .2f'%p_upper)

 0.38

### Conditional Probability

What is the probability that a student who is objectively in the working class associates himself with upper middle class?

P (sub UMC | obj WC) = ?

In [20]:
umc=contingency_table.loc[idx['Upper Middle Class'], idx['Working Class']]
total=contingency_table.loc[idx['All'], idx['Working Class']]
p_upper=umc/total
print('% .2f'%p_upper)

 0.17

### Bayes’ Theorem
P (A | B) =
P (A & B)
P (B)

P (sub UMC | obj WC) = P (sub UMC & obj WC) /P (obj WC)=?

In [21]:
p_umc=contingency_table.loc[idx['Upper Middle Class'], idx['Working Class']]
total1=contingency_table.loc[idx['All'], idx['All']]

p_wc=contingency_table.loc[idx['All'], idx['Working Class']]
total2=contingency_table.loc[idx['All'], idx['All']]

pAB=(p_umc/total1)/(p_wc/total2)
print('% .2f'%pAB)

 0.17